# 재귀호출, 백트래킹
# 중급 문제집

# 그래프
# - DFS, BFS
# - 최단거리
#   - A -> B 로 가는 가장 짧은 거리
# - 최소비용
#   - 모든 노드를 가장 저렴하게 연결하는 그래프는 무엇인가


# 트리 (싸이클이 없는 그래프)
# - 이진 트리
#   - 이진 트리 순회
#   - 이진 트리를 활용한 자료구조
#     - 이진 탐색 트리
#     - 힙


# 이진 탐색
#   - lower bound / upper bound
#   - parametric search

#웹주차
# - 이해 난이도: 하
# - 양이 매우 많음
# - 전부를 외우지말기=> 과목평가용으로 공부


#그래프
# -데이터 간 관계를 표현하기 위해서
# - 표현방식: 인접행렬, 인접리스트

# 트리자료구조
#- 계층구조 + 탐색 + 최적화
#- 고급자료구조
# - 파일 시스템
# -DB 인덱스
# -힙(heap), 이진 탐색 트리
# - 세그먼트 트리
#-red-black

# 트리(싸이클이 없는 그래프)
#- 코드 표현방식
#- 순회(어떤 순서로 데이터를 쓸 것인가?)
#=> 그냥 그래프 했던 것처럼 사용

# 이진트리
#- 트리 중 가장 많아 활용되는 트리
#- 자식이 최대 2개까지만 가능한 트리
#- 높이는 낮을수록 좋음
#- 코드 표현방식
#   - 1차원 리스트에 저장하는 방식
#      - 간단하게 저장하는 방식(노드의 수가 많지 않을 때 활용)
#       - 왼쪽 자식과 오른쪽 자시 인덱스를 바로 계산가능
#   - 인접리스트
#   - 기본 그래프처럼 똑같이 활용하자

# 이진 탐색 트리
# - 나보다 작으면 왼쪽, 크면 오른쪽에 넣자.
# - 각 연산의 원리 + 시간복잡도
#   - 탐색
#   - 삽입
#   - 삭제





# 힙
# - 부모를 자식보다 크게(작게) 유지하자
# - 각 연산의 원리 + 시간복잡도
#   - 탐색
#   - 삽입
#   - 삭제
# - 코드까지 연습 (heapq)


